In [1]:
import pandas as pd

In [4]:
s= pd.Series(['banana',42])
s

0    banana
1        42
dtype: object

In [5]:
s[0],s[1]

('banana', 42)

In [6]:
pd.Series(['element A', 'element B'], index=['First','Second'])

First     element A
Second    element B
dtype: object

In [8]:
pd.DataFrame({'Name':['Paco', 'Juan'], 'Occupation':['dev', 'barber'],'Age':[23, 54]})

   Age  Name Occupation
0   23  Paco        dev
1   54  Juan     barber

In [10]:
pd.DataFrame({'Name':['Paco', 'Juan'], 'Occupation':['dev', 'barber'],'Age':[23, 54]}, columns=['Name', 'Age', 'Occupation'])

   Name  Age Occupation
0  Paco   23        dev
1  Juan   54     barber

In [13]:
x = pd.DataFrame({'Occupation':['dev', 'barber'],'Age':[23, 54]}, columns=[ 'Age', 'Occupation'], index=['Paco', 'Juan'])

In [25]:
x.loc[:,],type(x.loc[:, ['Age']])

(      Age Occupation
 Paco   23        dev
 Juan   54     barber, pandas.core.frame.DataFrame)

In [27]:
s = x.loc['Paco']
s

Age            23
Occupation    dev
Name: Paco, dtype: object

In [29]:
s.index

Index(['Age', 'Occupation'], dtype='object')

In [30]:
s.keys()

Index(['Age', 'Occupation'], dtype='object')

In [31]:
s.values

array([23, 'dev'], dtype=object)

In [33]:
r = x['Age']
r, type(r)

(Paco    23
 Juan    54
 Name: Age, dtype: int64, pandas.core.series.Series)

In [34]:
r.describe()

count     2.00000
mean     38.50000
std      21.92031
min      23.00000
25%      30.75000
50%      38.50000
75%      46.25000
max      54.00000
Name: Age, dtype: float64

In [35]:
r.mean()

38.5

In [36]:
scientists = pd.read_csv('../data/scientists.csv')
scientists.head()

                   Name        Born        Died  Age    Occupation
0     Rosaline Franklin  1920-07-25  1958-04-16   37       Chemist
1        William Gosset  1876-06-13  1937-10-16   61  Statistician
2  Florence Nightingale  1820-05-12  1910-08-13   90         Nurse
3           Marie Curie  1867-11-07  1934-07-04   66       Chemist
4         Rachel Carson  1907-05-27  1964-04-14   56     Biologist

In [37]:
ages = scientists['Age']
ages

0    37
1    61
2    90
3    66
4    56
5    45
6    41
7    77
Name: Age, dtype: int64

In [38]:
ages.mean()

59.125

In [39]:
ages.describe()

count     8.000000
mean     59.125000
std      18.325918
min      37.000000
25%      44.000000
50%      58.500000
75%      68.750000
max      90.000000
Name: Age, dtype: float64

In [44]:
f = ages[ages >ages.mean()]
f

1    61
2    90
3    66
7    77
Name: Age, dtype: int64

In [45]:
f.loc[2]

90

In [46]:
f.iloc[2]

66

In [51]:
ages[[True]*2+[False]*5+[True]]

0    37
1    61
7    77
Name: Age, dtype: int64

In [52]:
ages*2

0     74
1    122
2    180
3    132
4    112
5     90
6     82
7    154
Name: Age, dtype: int64

In [53]:
ages+2

0    39
1    63
2    92
3    68
4    58
5    47
6    43
7    79
Name: Age, dtype: int64

In [54]:
ages + pd.Series([1,10])

0    38.0
1    71.0
2     NaN
3     NaN
4     NaN
5     NaN
6     NaN
7     NaN
dtype: float64

In [55]:
scientists

                   Name        Born        Died  Age          Occupation
0     Rosaline Franklin  1920-07-25  1958-04-16   37             Chemist
1        William Gosset  1876-06-13  1937-10-16   61        Statistician
2  Florence Nightingale  1820-05-12  1910-08-13   90               Nurse
3           Marie Curie  1867-11-07  1934-07-04   66             Chemist
4         Rachel Carson  1907-05-27  1964-04-14   56           Biologist
5             John Snow  1813-03-15  1858-06-16   45           Physician
6           Alan Turing  1912-06-23  1954-06-07   41  Computer Scientist
7          Johann Gauss  1777-04-30  1855-02-23   77       Mathematician

In [65]:
scientists[scientists['Age']>scientists['Age'].mean()].sort_values(by=['Age'], ascending=False)

                   Name        Born        Died  Age     Occupation
2  Florence Nightingale  1820-05-12  1910-08-13   90          Nurse
7          Johann Gauss  1777-04-30  1855-02-23   77  Mathematician
3           Marie Curie  1867-11-07  1934-07-04   66        Chemist
1        William Gosset  1876-06-13  1937-10-16   61   Statistician

In [66]:
scientists*2

,Name,Born,Died,Age,Occupation
0,Rosaline FranklinRosaline Franklin,1920-07-251920-07-25,1958-04-161958-04-16,74,ChemistChemist
1,William GossetWilliam Gosset,1876-06-131876-06-13,1937-10-161937-10-16,122,StatisticianStatistician
2,Florence NightingaleFlorence Nightingale,1820-05-121820-05-12,1910-08-131910-08-13,180,NurseNurse
3,Marie CurieMarie Curie,1867-11-071867-11-07,1934-07-041934-07-04,132,ChemistChemist
4,Rachel CarsonRachel Carson,1907-05-271907-05-27,1964-04-141964-04-14,112,BiologistBiologist
5,John SnowJohn Snow,1813-03-151813-03-15,1858-06-161858-06-16,90,PhysicianPhysician
6,Alan TuringAlan Turing,1912-06-231912-06-23,1954-06-071954-06-07,82,Computer ScientistComputer Scientist
7,Johann GaussJohann Gauss,1777-04-301777-04-30,1855-02-231855-02-23,154,MathematicianMathematician

In [68]:
scientists.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 8 entries, 0 to 7
Data columns (total 5 columns):
Name          8 non-null object
Born          8 non-null object
Died          8 non-null object
Age           8 non-null int64
Occupation    8 non-null object
dtypes: int64(1), object(4)
memory usage: 400.0+ bytes

In [75]:
born_datetime = pd.to_datetime(scientists.Born, format='%Y-%m-%d')
born_datetime, type(born_datetime), type(scientists.Born)

(0   1920-07-25
 1   1876-06-13
 2   1820-05-12
 3   1867-11-07
 4   1907-05-27
 5   1813-03-15
 6   1912-06-23
 7   1777-04-30
 Name: Born, dtype: datetime64[ns],
 pandas.core.series.Series,
 pandas.core.series.Series)

In [72]:
died_datetime = pd.to_datetime(scientists.Died, format='%Y-%m-%d')
died_datetime

0   1958-04-16
1   1937-10-16
2   1910-08-13
3   1934-07-04
4   1964-04-14
5   1858-06-16
6   1954-06-07
7   1855-02-23
Name: Died, dtype: datetime64[ns]

In [73]:
scientists_original = scientists.copy()

In [76]:
scientists['born_dt'] = born_datetime
scientists['died_dt'] = died_datetime

In [77]:
scientists

,Name,Born,Died,Age,Occupation,born_dt,died_dt
0,Rosaline Franklin,1920-07-25,1958-04-16,37,Chemist,1920-07-25,1958-04-16
1,William Gosset,1876-06-13,1937-10-16,61,Statistician,1876-06-13,1937-10-16
2,Florence Nightingale,1820-05-12,1910-08-13,90,Nurse,1820-05-12,1910-08-13
3,Marie Curie,1867-11-07,1934-07-04,66,Chemist,1867-11-07,1934-07-04
4,Rachel Carson,1907-05-27,1964-04-14,56,Biologist,1907-05-27,1964-04-14
5,John Snow,1813-03-15,1858-06-16,45,Physician,1813-03-15,1858-06-16
6,Alan Turing,1912-06-23,1954-06-07,41,Computer Scientist,1912-06-23,1954-06-07
7,Johann Gauss,1777-04-30,1855-02-23,77,Mathematician,1777-04-30,1855-02-23

In [78]:
scientists.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 8 entries, 0 to 7
Data columns (total 7 columns):
Name          8 non-null object
Born          8 non-null object
Died          8 non-null object
Age           8 non-null int64
Occupation    8 non-null object
born_dt       8 non-null datetime64[ns]
died_dt       8 non-null datetime64[ns]
dtypes: datetime64[ns](2), int64(1), object(4)
memory usage: 528.0+ bytes

In [79]:
scientists.Age = scientists.Age+1

In [80]:
scientists

,Name,Born,Died,Age,Occupation,born_dt,died_dt
0,Rosaline Franklin,1920-07-25,1958-04-16,38,Chemist,1920-07-25,1958-04-16
1,William Gosset,1876-06-13,1937-10-16,62,Statistician,1876-06-13,1937-10-16
2,Florence Nightingale,1820-05-12,1910-08-13,91,Nurse,1820-05-12,1910-08-13
3,Marie Curie,1867-11-07,1934-07-04,67,Chemist,1867-11-07,1934-07-04
4,Rachel Carson,1907-05-27,1964-04-14,57,Biologist,1907-05-27,1964-04-14
5,John Snow,1813-03-15,1858-06-16,46,Physician,1813-03-15,1858-06-16
6,Alan Turing,1912-06-23,1954-06-07,42,Computer Scientist,1912-06-23,1954-06-07
7,Johann Gauss,1777-04-30,1855-02-23,78,Mathematician,1777-04-30,1855-02-23

In [81]:
import random
random.seed(42)

In [82]:
random.shuffle(scientists['Age'])
scientists

/usr/lib/python3.6/random.py:274: SettingWithCopyWarning:
A value is trying to be set on a copy of a slice from a DataFrame

See the caveats in the documentation: http://pandas.pydata.org/pandas-docs/stable/indexing.html#indexing-view-versus-copy
  x[i], x[j] = x[j], x[i]

,Name,Born,Died,Age,Occupation,born_dt,died_dt
0,Rosaline Franklin,1920-07-25,1958-04-16,67,Chemist,1920-07-25,1958-04-16
1,William Gosset,1876-06-13,1937-10-16,57,Statistician,1876-06-13,1937-10-16
2,Florence Nightingale,1820-05-12,1910-08-13,42,Nurse,1820-05-12,1910-08-13
3,Marie Curie,1867-11-07,1934-07-04,78,Chemist,1867-11-07,1934-07-04
4,Rachel Carson,1907-05-27,1964-04-14,91,Biologist,1907-05-27,1964-04-14
5,John Snow,1813-03-15,1858-06-16,46,Physician,1813-03-15,1858-06-16
6,Alan Turing,1912-06-23,1954-06-07,38,Computer Scientist,1912-06-23,1954-06-07
7,Johann Gauss,1777-04-30,1855-02-23,62,Mathematician,1777-04-30,1855-02-23

In [86]:
scientists['age_days_dt'] = scientists.died_dt - scientists.born_dt   
scientists

,Name,Born,Died,Age,Occupation,born_dt,died_dt,age_days_dt,age_dayt
0,Rosaline Franklin,1920-07-25,1958-04-16,67,Chemist,1920-07-25,1958-04-16,13779 days,13779 days
1,William Gosset,1876-06-13,1937-10-16,57,Statistician,1876-06-13,1937-10-16,22404 days,22404 days
2,Florence Nightingale,1820-05-12,1910-08-13,42,Nurse,1820-05-12,1910-08-13,32964 days,32964 days
3,Marie Curie,1867-11-07,1934-07-04,78,Chemist,1867-11-07,1934-07-04,24345 days,24345 days
4,Rachel Carson,1907-05-27,1964-04-14,91,Biologist,1907-05-27,1964-04-14,20777 days,20777 days
5,John Snow,1813-03-15,1858-06-16,46,Physician,1813-03-15,1858-06-16,16529 days,16529 days
6,Alan Turing,1912-06-23,1954-06-07,38,Computer Scientist,1912-06-23,1954-06-07,15324 days,15324 days
7,Johann Gauss,1777-04-30,1855-02-23,62,Mathematician,1777-04-30,1855-02-23,28422 days,28422 days

In [88]:
scientists.drop('age_dayt', axis=1, inplace=True)

In [89]:
scientists

,Name,Born,Died,Age,Occupation,born_dt,died_dt,age_days_dt
0,Rosaline Franklin,1920-07-25,1958-04-16,67,Chemist,1920-07-25,1958-04-16,13779 days
1,William Gosset,1876-06-13,1937-10-16,57,Statistician,1876-06-13,1937-10-16,22404 days
2,Florence Nightingale,1820-05-12,1910-08-13,42,Nurse,1820-05-12,1910-08-13,32964 days
3,Marie Curie,1867-11-07,1934-07-04,78,Chemist,1867-11-07,1934-07-04,24345 days
4,Rachel Carson,1907-05-27,1964-04-14,91,Biologist,1907-05-27,1964-04-14,20777 days
5,John Snow,1813-03-15,1858-06-16,46,Physician,1813-03-15,1858-06-16,16529 days
6,Alan Turing,1912-06-23,1954-06-07,38,Computer Scientist,1912-06-23,1954-06-07,15324 days
7,Johann Gauss,1777-04-30,1855-02-23,62,Mathematician,1777-04-30,1855-02-23,28422 days

In [91]:
scientists['age_years_dt'] = scientists.age_days_dt.astype('timedelta64[Y]')
scientists['Age'] = scientists.age_days_dt.astype('timedelta64[Y]')
scientists

,Name,Born,Died,Age,Occupation,born_dt,died_dt,age_days_dt,age_years_dt
0,Rosaline Franklin,1920-07-25,1958-04-16,37.0,Chemist,1920-07-25,1958-04-16,13779 days,37.0
1,William Gosset,1876-06-13,1937-10-16,61.0,Statistician,1876-06-13,1937-10-16,22404 days,61.0
2,Florence Nightingale,1820-05-12,1910-08-13,90.0,Nurse,1820-05-12,1910-08-13,32964 days,90.0
3,Marie Curie,1867-11-07,1934-07-04,66.0,Chemist,1867-11-07,1934-07-04,24345 days,66.0
4,Rachel Carson,1907-05-27,1964-04-14,56.0,Biologist,1907-05-27,1964-04-14,20777 days,56.0
5,John Snow,1813-03-15,1858-06-16,45.0,Physician,1813-03-15,1858-06-16,16529 days,45.0
6,Alan Turing,1912-06-23,1954-06-07,41.0,Computer Scientist,1912-06-23,1954-06-07,15324 days,41.0
7,Johann Gauss,1777-04-30,1855-02-23,77.0,Mathematician,1777-04-30,1855-02-23,28422 days,77.0

In [93]:
names  = scientists.Name
names

0       Rosaline Franklin
1          William Gosset
2    Florence Nightingale
3             Marie Curie
4           Rachel Carson
5               John Snow
6             Alan Turing
7            Johann Gauss
Name: Name, dtype: object

In [94]:
names.to_pickle('names_series.pickle')

In [95]:
scientists.to_pickle('scientists_df.pickle')

In [96]:
pd.read_pickle('names_series.pickle')

0       Rosaline Franklin
1          William Gosset
2    Florence Nightingale
3             Marie Curie
4           Rachel Carson
5               John Snow
6             Alan Turing
7            Johann Gauss
Name: Name, dtype: object

In [97]:
pd.read_pickle('scientists_df.pickle')

,Name,Born,Died,Age,Occupation,born_dt,died_dt,age_days_dt,age_years_dt
0,Rosaline Franklin,1920-07-25,1958-04-16,37.0,Chemist,1920-07-25,1958-04-16,13779 days,37.0
1,William Gosset,1876-06-13,1937-10-16,61.0,Statistician,1876-06-13,1937-10-16,22404 days,61.0
2,Florence Nightingale,1820-05-12,1910-08-13,90.0,Nurse,1820-05-12,1910-08-13,32964 days,90.0
3,Marie Curie,1867-11-07,1934-07-04,66.0,Chemist,1867-11-07,1934-07-04,24345 days,66.0
4,Rachel Carson,1907-05-27,1964-04-14,56.0,Biologist,1907-05-27,1964-04-14,20777 days,56.0
5,John Snow,1813-03-15,1858-06-16,45.0,Physician,1813-03-15,1858-06-16,16529 days,45.0
6,Alan Turing,1912-06-23,1954-06-07,41.0,Computer Scientist,1912-06-23,1954-06-07,15324 days,41.0
7,Johann Gauss,1777-04-30,1855-02-23,77.0,Mathematician,1777-04-30,1855-02-23,28422 days,77.0

In [98]:
names.to_csv('names_series.csv')
scientists.to_csv('scientists_df.csv')

In [100]:
names.to_json('names_series.json')
scientists.to_json('scientists_df.json')

In [101]:
names.to_csv('names_series.tsv', sep='\t')
scientists.to_csv('scientists_df.tsv', sep='\t')

In [102]:
names.to_excel('names_series.xlsx')
scientists.to_excel('scientists_df.xlsx')

In [103]:
scientists.to_excel('scientists_df_1.xlsx', sheet_name='scientists', index=False)